#Пирожок в столовой стоит A рублей и B копеек.
#Определите, сколько рублей и копеек нужно заплатить за N пирожков.
Формат ввода 
a = int(input())
b = a - 1
n = a + 1
print('The next number for', a, 'is', n)
print('The previous number for', a, 'is', b)
